Tekla Open API Reference for Tekla Structures 2025
ContainerView Properties
The ContainerView type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 (Inherited from DrawingObject.)
ExtremaCenter
 Gets the view extrema center.
 (Inherited from ViewBase.)
FrameOrigin
 The vector from the view origin to the frame origin.
 (Inherited from ViewBase.)
Height
 The height of the view frame in paper coordinates.
 (Inherited from ViewBase.)
IsSheet
 Gets a value indicating whether the container view is the drawing's sheet.
 (Inherited from ViewBase.)
Origin
 The view origin coordinates in the sheet.
 (Inherited from ViewBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Width
 The width of the view frame in paper coordinates.
 (Inherited from ViewBase.)
Top
See Also
Reference
ContainerView Class
Tekla.Structures.Drawing Namespace